In [1]:
import pandas as pd

In [2]:
data = {
    "product": ["Laptop", "Mouse", "Monitor", "Keyboard", "Webcam"],
    "price": [1000, 25, 200, 50, 80],
    "stock": [5, 100, 10, 30, 15]
}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

    product  price  stock
0    Laptop   1000      5
1     Mouse     25    100
2   Monitor    200     10
3  Keyboard     50     30
4    Webcam     80     15

In [7]:
df.head(4)

    product  price  stock
0    Laptop   1000      5
1     Mouse     25    100
2   Monitor    200     10
3  Keyboard     50     30

In [8]:
df.shape

(5, 3)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   product  5 non-null      object
 1   price    5 non-null      int64
 2   stock    5 non-null      int64
dtypes: int64(2), object(1)
memory usage: 252.0+ bytes

In [11]:
df["product"]

0      Laptop
1       Mouse
2     Monitor
3    Keyboard
4      Webcam
Name: product, dtype: object

In [12]:
df[["product", "price"]]

    product  price
0    Laptop   1000
1     Mouse     25
2   Monitor    200
3  Keyboard     50
4    Webcam     80

In [18]:
high_stocks = df[ df["stock"]  > 20 ]
high_stocks

    product  price  stock
1     Mouse     25    100
3  Keyboard     50     30

In [20]:
#TASK

In [21]:
expensive_df = df[ df["price"] > 50]
expensive_df

   product  price  stock
0   Laptop   1000      5
2  Monitor    200     10
4   Webcam     80     15

In [22]:
df["tax"] = df["price"] * 0.10
df

    product  price  stock    tax
0    Laptop   1000      5  100.0
1     Mouse     25    100    2.5
2   Monitor    200     10   20.0
3  Keyboard     50     30    5.0
4    Webcam     80     15    8.0

In [23]:
df["total_value"] = df["price"]  * df["stock"]
df

    product  price  stock    tax  total_value
0    Laptop   1000      5  100.0         5000
1     Mouse     25    100    2.5         2500
2   Monitor    200     10   20.0         2000
3  Keyboard     50     30    5.0         1500
4    Webcam     80     15    8.0         1200

In [24]:
df.head(1)

  product  price  stock    tax  total_value
0  Laptop   1000      5  100.0         5000

In [25]:
df.to_csv("inventory_report.csv", index=False)

In [26]:
exit